{
    "profile" : {
        "name": "Ahmed Tarek Ahmed",
        "nickName": "Medo",
        "phone": "+201125661193",
        "other_phone": "+201115408161",
        "birth_date": "August 24, 1993",
        "sm_address": "Maadi, Cairo, Egypt",
        "lg_address": "17 Saqr Quraish, Al Kanadi, Maadi, Cairo, Egypt",
        "zip_code": "19311",
        "email": "dark_cat_95@yahoo.com",
        "other_email": "darkahmed1990@gmail.com",
        "projects": "25",
        "sm_about": "I am an iOS Developer with a Bachelor of Language and Translation from International College for Language and Commerce. I have self-studied Mobile Application Development at the Russian Culture Center and hold a Diploma in Software Engineering from Cairo University. Passionate about continuous learning, I am always working to expand my knowledge and stay updated with the latest technologies.",
        "md_about": "An iOS Developer passionate about crafting efficient and user-friendly applications using Swift. With strong expertise in Objective-C, SwiftUI, and Combine, I excel in building seamless and intuitive iOS experiences. <br>Additionally, I bring a solid understanding of Kotlin, Java, Spring Framework, and SQL, complemented by a keen eye for designing clean and engaging UIs. My diverse skill set enables me to contribute effectively to both mobile development and backend integrations, ensuring robust and scalable solutions. <br> Senior iOS Software Engineer | UIKit & SwiftUI | MV Architecture",
        "lg_about": "An iOS Developer who loves coding with swift. I have strong knowledge in Objective-C, Swift, SwiftUI & Combine. I have also a very good knowledge kotlin, java, spring framework, SQL and good knowledge of designing UI.<br>I am an enthusiastic iOS Developer who loves coding with Swift. I have a strong foundation in Objective-C, SwiftUI, and Combine, enabling me to create seamless and innovative iOS applications.<br>In addition to iOS development, I have solid experience with kotlin, Java, Spring Framework, and SQL, allowing me to contribute effectively to cross-platform projects and backend integrations. I also possess a good understanding of UI design, ensuring that the applications I develop are not only functional but also visually engaging and user-friendly.<br>With a passion for building high-quality software, I strive to deliver solutions that combine technical excellence with exceptional user experiences.<br>Senior iOS Software Engineer |UIKit & SwiftUI | MV Architecture.",
        "html_about": "An <span class=\"text-black dark:text-white\">iOS Developer</span> who loves coding with <span class=\"text-black dark:text-white\">swift</span>. I have strong knowledge in <span class=\"text-black dark:text-white\">Objective-C</span>, <span class=\"text-black dark:text-white\">Swift</span>, <span class=\"text-black dark:text-white\">SwiftUI</span> & <span class=\"text-black dark:text-white\">Combine</span>. I have also a very good knowledge <span class=\"text-black dark:text-white\">kotlin</span>, <span class=\"text-black dark:text-white\">java</span>, <span class=\"text-black dark:text-white\">spring framework</span>, <span class=\"text-black dark:text-white\">SQL</span> and good knowledge of <span class=\"text-black dark:text-white\">designing UI</span>.<br>I am an enthusiastic <span class=\"text-black dark:text-white\">iOS Developer</span> who loves coding with Swift. I have a strong foundation in Objective-C, SwiftUI, and Combine, enabling me to create seamless and innovative iOS applications.<br>In addition to iOS development, I have solid experience with <span class=\"text-black dark:text-white\">kotlin</span>, <span class=\"text-black dark:text-white\">Java</span>, <span class=\"text-black dark:text-white\">Spring Framework</span>, and <span class=\"text-black dark:text-white\">SQL</span>, allowing me to contribute effectively to <span class=\"text-black dark:text-white\">cross-platform projects</span> and <span class=\"text-black dark:text-white\">backend integrations</span>. I also possess a good understanding of <span class=\"text-black dark:text-white\">UI design</span>, ensuring that the applications I develop are not only functional but also visually engaging and <span class=\"text-black dark:text-white\">user-friendly</span>.<br>With a passion for building <span class=\"text-black dark:text-white\">high-quality software</span>, I strive to deliver solutions that combine technical excellence with exceptional <span class=\"text-black dark:text-white\">user experiences</span>.<br><span class=\"text-black dark:text-white\">Senior iOS Software Engineer</span> |<span class=\"text-black dark:text-white\">UIKit & SwiftUI</span>  | <span class=\"text-black dark:text-white\">MV Architecture</span>."
    },
    "education": [
        {
            "name": "International College for Language and Commerce",
            "date": "2013 - 2016",
            "tite": "English Language and Literature/Letters",
            "todo": "Bachelor of Language and Translation."
        },
        {
            "name": "Ministry of defense",
            "date": "2015",
            "tite": "Java Advanced",
            "todo": ""
        },
        {
            "name": "Udemy",
            "date": "2016",
            "tite": "Data Structure and Algorithms Analysis",
            "todo": "In this course, I learned to analyze algorithms like Sorting, Searching, and Graph algorithms, and reduce code complexity across different Big-O levels. I explored various data structures, determined their Big-O, and applied the correct ones to problems in Java. By the end, I was able to write optimized code that runs faster, uses less memory, and solved problems using Dynamic Programming."
        },
        {
            "name": "Russian culture center",
            "date": "Apr 2019 - Aug 2019",
            "tite": "Mobile Application Development",
            "todo": "I studied Mobile Application Development at the Russian Culture Center, where I gained practical skills and knowledge to build mobile apps and enhance my development expertise."
        },
        {
            "name": "Cairo University",
            "date": "2022 - 2023",
            "tite": "Faculty of Applied Engineering",
            "todo": "Diploma in Software Engineering."
        }
    ],
     "work": [
        {
            "name": "Awfar.com",
            "date": "Feb 2020 - Present",
            "position": "Senior iOS Software Engineer",
            "location": "Maadi",
            "role": "Full-time",
            "todo": "Worked as an iOS Developer, contributing to multiple projects, including:<br>1.  El Ezaby Pharmacy App: Developed using SwiftUI, Combine, and MVI, integrating with PHP API services.<br>2.  Shopper App: Designed a new mobile interface for their existing app.<br>3.  Chat Website: Collaborated on building and designing a chat platform using Angular 11, later updating it to a new version with React.js and Node.js.<br>4.  Awfar Chat App: Built using Swift and MVVM, then migrated to SwiftUI, Combine, and MVI, with integration to Node.js and Socket.IO. This app consolidates conversations from WhatsApp, Facebook, Instagram, Telegram, and X (Twitter) for call center operations, enabling streamlined customer support.<br>5.  Awfar E-commerce Project: Developed a template app with customizable schemes tailored to different businesses."
        },
        {
            "name": "TEBCOM FOR MEDICAL TECHNOLOGY SERVICES",
            "date": "Feb 2022 - Feb 2024",
            "position": "Senior iOS Developer",
            "location": "New Cairo",
            "role": "Freelance",
            "todo": "Developed TEBCOM, a comprehensive Closed-Loop Tele-Consultation solution with two tailored schemes:<br>1.  TEBCOM for Patients: Designed for patients to easily access professional healthcare services from anywhere.<br>2.  TEBCOM - Doctor for Doctors: Built to help doctors manage virtual consultations and provide one-on-one care seamlessly.<br>The apps enable virtual clinics, breaking barriers to healthcare access across the globe. Integrated with .NET, SignalR for real-time communication, and Twilio for secure video and audio calls. Developed using Swift and the MVP architecture, this solution ensures doctors can run their online practices as efficiently as their physical ones, delivering professional care while maintaining quality and reliability."
        },
        {
            "name": "Millennium for Investment & Information Technology",
            "date": "Feb 2021 - Mar 2021",
            "position": "iOS Developer",
            "location": "Zahraa Maadi",
            "role": "Freelance",
            "todo": "Developed La Maison, a template app designed to streamline the management of residential compounds. The app facilitates communication between residents and administration, provides access to compound services, and manages compound news and resident requests.<br>Key features include QR code access for residents to securely enter their homes and QR code invitations for visitors, enhancing compound security. Built using Swift, with Alamofire for networking, and structured with the MVP architecture, the app is seamlessly integrated with PHP API services."
        },
        {
            "name": "Millennium for Investment & Information Technology",
            "date": "Dec 2019 - Jan 2020",
            "position": "iOS Developer",
            "location": "Qatar",
            "role": "Freelance",
            "todo": "Developed Q-Clinics, an intuitive and user-friendly medical appointment scheduling app tailored for Qatar. The app simplifies the booking process by allowing patients to log in, select their desired service, and choose a convenient time slot, eliminating the hassle of traditional appointment scheduling.<br>Built using Swift, with Alamofire for networking, and structured with the MVP architecture, the app seamlessly integrates with PHP API services to provide a smooth and efficient experience for users."
        },
        {
            "name": "Awfar Inc.",
            "date": "Apr 2019 - Aug 2019",
            "position": "iOS Developer",
            "location": "Maadi",
            "role": "Part-Time",
            "todo": "Developed Awfar Restaurants, a template app designed to support customizable schemes for various restaurants. The app provides a user-friendly interface for customers to easily make online reservations, allowing them to select their preferred time and table. Built using Swift, with Alamofire for networking, and implemented the MVP architecture, seamlessly integrated with PHP API services."
        },
        {
            "name": "Entrepreware",
            "date": "Feb 2018 - Mars 2020",
            "position": "Android & iOS Developer",
            "location": "Maadi",
            "role": "Full-Time",
            "todo": "Started as an Android Development intern, gaining hands-on experience through a side project and assisting with the main project. Progressed to contribute to a Spring Boot MVC project, where I designed and implemented a new feature called “Cafeteria” a POS system. <br>Later transitioned to working on the company’s primary iOS Objective-C template project for schools. This multi-scheme project integrated with Spring Boot MVC APIs and a camera system, enabling parents to monitor their children.<br>Finally, contributed to the development of the Edufy app, built with Ionic (Angular+). This app allows teachers to assign homework, track attendance, and manage various classroom activities."
        },
        {
            "name": "Entrepreware",
            "date": "Dec 2017 - Feb 2018",
            "position": "Android Developer Intern",
            "location": "Maadi",
            "role": "Intern",
            "todo": "Create simple project with it's backend using Java and Boot Spring MVC."
        }
    ]
}