{
    "profile" : {
        "name": "Ahmed Tarek Ahmed",
        "nickName": "Medo",
        "phone": "+201125661193",
        "other_phone": "+201115408161",
        "birth_date": "August 24, 1993",
        "sm_address": "Maadi, Cairo, Egypt",
        "lg_address": "17 Saqr Quraish, Al Kanadi, Maadi, Cairo, Egypt",
        "zip_code": "19311",
        "email": "dark_cat_95@yahoo.com",
        "other_email": "darkahmed1990@gmail.com",
        "projects": "25",
        "sm_about": "I am an iOS Developer with a Bachelor of Language and Translation from International College for Language and Commerce. I have self-studied Mobile Application Development at the Russian Culture Center and hold a Diploma in Software Engineering from Cairo University. Passionate about continuous learning, I am always working to expand my knowledge and stay updated with the latest technologies.",
        "md_about": "An iOS Developer passionate about crafting efficient and user-friendly applications using Swift. With strong expertise in Objective-C, SwiftUI, and Combine, I excel in building seamless and intuitive iOS experiences. <br>Additionally, I bring a solid understanding of Kotlin, Java, Spring Framework, and SQL, complemented by a keen eye for designing clean and engaging UIs. My diverse skill set enables me to contribute effectively to both mobile development and backend integrations, ensuring robust and scalable solutions. <br> Senior iOS Software Engineer | UIKit & SwiftUI | MV Architecture",
        "lg_about": "An iOS Developer who loves coding with swift. I have strong knowledge in Objective-C, Swift, SwiftUI & Combine. I have also a very good knowledge kotlin, java, spring framework, SQL and good knowledge of designing UI.<br>I am an enthusiastic iOS Developer who loves coding with Swift. I have a strong foundation in Objective-C, SwiftUI, and Combine, enabling me to create seamless and innovative iOS applications.<br>In addition to iOS development, I have solid experience with kotlin, Java, Spring Framework, and SQL, allowing me to contribute effectively to cross-platform projects and backend integrations. I also possess a good understanding of UI design, ensuring that the applications I develop are not only functional but also visually engaging and user-friendly.<br>With a passion for building high-quality software, I strive to deliver solutions that combine technical excellence with exceptional user experiences.<br>Senior iOS Software Engineer |UIKit & SwiftUI | MV Architecture.",
        "html_about": "An <span class=\"text-black dark:text-white\">iOS Developer</span> who loves coding with <span class=\"text-black dark:text-white\">swift</span>. I have strong knowledge in <span class=\"text-black dark:text-white\">Objective-C</span>, <span class=\"text-black dark:text-white\">Swift</span>, <span class=\"text-black dark:text-white\">SwiftUI</span> & <span class=\"text-black dark:text-white\">Combine</span>. I have also a very good knowledge <span class=\"text-black dark:text-white\">kotlin</span>, <span class=\"text-black dark:text-white\">java</span>, <span class=\"text-black dark:text-white\">spring framework</span>, <span class=\"text-black dark:text-white\">SQL</span> and good knowledge of <span class=\"text-black dark:text-white\">designing UI</span>.<br>I am an enthusiastic <span class=\"text-black dark:text-white\">iOS Developer</span> who loves coding with Swift. I have a strong foundation in Objective-C, SwiftUI, and Combine, enabling me to create seamless and innovative iOS applications.<br>In addition to iOS development, I have solid experience with <span class=\"text-black dark:text-white\">kotlin</span>, <span class=\"text-black dark:text-white\">Java</span>, <span class=\"text-black dark:text-white\">Spring Framework</span>, and <span class=\"text-black dark:text-white\">SQL</span>, allowing me to contribute effectively to <span class=\"text-black dark:text-white\">cross-platform projects</span> and <span class=\"text-black dark:text-white\">backend integrations</span>. I also possess a good understanding of <span class=\"text-black dark:text-white\">UI design</span>, ensuring that the applications I develop are not only functional but also visually engaging and <span class=\"text-black dark:text-white\">user-friendly</span>.<br>With a passion for building <span class=\"text-black dark:text-white\">high-quality software</span>, I strive to deliver solutions that combine technical excellence with exceptional <span class=\"text-black dark:text-white\">user experiences</span>.<br><span class=\"text-black dark:text-white\">Senior iOS Software Engineer</span> |<span class=\"text-black dark:text-white\">UIKit & SwiftUI</span>  | <span class=\"text-black dark:text-white\">MV Architecture</span>."
    },
    "education": [
        {
            "name": "International College for Language and Commerce",
            "date": "2013 - 2016",
            "tite": "English Language and Literature/Letters",
            "todo": "Bachelor of Language and Translation."
        },
        {
            "name": "Ministry of defense",
            "date": "2015",
            "tite": "Java Advanced",
            "todo": "This advanced Java course is designed to enhance the skills of defense personnel in building robust, scalable, and secure applications tailored to meet the complex needs of defense systems. Participants will delve into high-level Java concepts, including multithreading, performance optimization, data security, and enterprise application development. The course emphasizes real-world defense scenarios, enabling developers to create efficient solutions for mission-critical operations, ensuring high performance, reliability, and security. By the end of the program, participants will be equipped with the knowledge to tackle sophisticated challenges in defense technology using advanced Java techniques."
        },
        {
            "name": "Udemy",
            "date": "2016",
            "tite": "Data Structure and Algorithms Analysis",
            "todo": "In this course, I learned to analyze algorithms like Sorting, Searching, and Graph algorithms, and reduce code complexity across different Big-O levels. I explored various data structures, determined their Big-O, and applied the correct ones to problems in Java. By the end, I was able to write optimized code that runs faster, uses less memory, and solved problems using Dynamic Programming."
        },
        {
            "name": "Russian culture center",
            "date": "Apr 2019 - Aug 2019",
            "tite": "Mobile Application Development",
            "todo": "I studied Mobile Application Development at the Russian Culture Center, where I gained practical skills and knowledge to build mobile apps and enhance my development expertise."
        },
        {
            "name": "Cairo University",
            "date": "2022 - 2023",
            "tite": "Faculty of Applied Engineering",
            "todo": "Diploma in Software Engineering. <br> The Diploma in Software Engineering offered by Cairo University’s Faculty of Applied Engineering provides students with a comprehensive foundation in software development, design, and maintenance. This program covers key areas such as programming languages, software architecture, database management, algorithms, data structures, and software project management. Through a combination of theoretical coursework and practical hands-on experience, students gain the skills necessary to develop, deploy, and maintain complex software solutions across various industries. Graduates of the program are prepared to excel in the dynamic field of software engineering, with a focus on developing high-quality, scalable, and efficient software systems."
        }
    ],
    "work": [
        {
            "name": "Awfar.com",
            "date": "Feb 2020 - Present",
            "position": "Senior iOS Software Engineer",
            "location": "Maadi",
            "role": "Full-time",
            "todo": "Worked as an iOS Developer, contributing to multiple projects, including:<br>1.  El Ezaby Pharmacy App: Developed using SwiftUI, Combine, and MVI, integrating with PHP API services.<br>2.  Awfar Connect App: Designed a new mobile interface for their existing app.<br>3.  Chat Website: Collaborated on building and designing a chat platform using Angular 11, later updating it to a new version with React.js and Node.js.<br>4.  Awfar Chat App: Built using Swift and MVVM, then migrated to SwiftUI, Combine, and MVI, with integration to Node.js and Socket.IO. This app consolidates conversations from WhatsApp, Facebook, Instagram, Telegram, and X (Twitter) for call center operations, enabling streamlined customer support.<br>5.  Awfar E-commerce Project: Developed a template app with customizable schemes tailored to different businesses."
        },
        {
            "name": "Wayak",
            "date": "Dec 2022 - Nov 2024",
            "position": "Senior iOS Software Engineer",
            "location": "Maadi",
            "role": "Freelance",
            "todo": "Healthcare Service Platform<br>Wayak is an innovative mobile application designed to simplify healthcare management while reducing costs. As an iOS developer, I contributed to building and optimizing an app that unifies multiple healthcare services, providing users with a seamless experience for managing prescriptions, consultations, and medical services.<br>Key Features Developed:<br>• Medication Delivery Service: Integrated a feature for free home delivery of prescribed medications, with savings up to 20%.<br>•  Easy Ordering System: Implemented search functionality for medications by name, category, or prescription upload, streamlining the ordering process.<br>•  Unlimited Medical Consultations: Developed a system for users to access free, unlimited medical consultations via the app.<br>•  Wayak Card Discounts: Integrated a digital card offering users up to 40% savings at trusted medical centers and labs.<br>•  User Experience Optimization: Focused on intuitive UI/UX design and efficient app performance to enhance user engagement and satisfaction.<br>This project highlights my proficiency in mobile app development, UI/UX design, and integrating third-party services to create a comprehensive and cost-effective healthcare solution."
        },
        {
            "name": "TEBCOM FOR MEDICAL TECHNOLOGY SERVICES",
            "date": "Feb 2022 - Feb 2024",
            "position": "Senior iOS Developer",
            "location": "New Cairo",
            "role": "Freelance",
            "todo": "Developed TEBCOM, a comprehensive Closed-Loop Tele-Consultation solution with two tailored schemes:<br>1.  TEBCOM for Patients: Designed for patients to easily access professional healthcare services from anywhere.<br>2.  TEBCOM - Doctor for Doctors: Built to help doctors manage virtual consultations and provide one-on-one care seamlessly.<br>The apps enable virtual clinics, breaking barriers to healthcare access across the globe. Integrated with .NET, SignalR for real-time communication, and Twilio for secure video and audio calls. Developed using Swift and the MVP architecture, this solution ensures doctors can run their online practices as efficiently as their physical ones, delivering professional care while maintaining quality and reliability."
        },
        {
            "name": "Millennium for Investment & Information Technology",
            "date": "Feb 2021 - Mar 2021",
            "position": "iOS Developer",
            "location": "Zahraa Maadi",
            "role": "Freelance",
            "todo": "Developed La Maison, a template app designed to streamline the management of residential compounds. The app facilitates communication between residents and administration, provides access to compound services, and manages compound news and resident requests.<br>Key features include QR code access for residents to securely enter their homes and QR code invitations for visitors, enhancing compound security. Built using Swift, with Alamofire for networking, and structured with the MVP architecture, the app is seamlessly integrated with PHP API services."
        },
        {
            "name": "QClinics",
            "date": "Dec 2019 - Jan 2020",
            "position": "iOS Developer",
            "location": "Qatar",
            "role": "Freelance",
            "todo": "Developed Q-Clinics, an intuitive and user-friendly medical appointment scheduling app tailored for Qatar. The app simplifies the booking process by allowing patients to log in, select their desired service, and choose a convenient time slot, eliminating the hassle of traditional appointment scheduling.<br>Built using Swift, with Alamofire for networking, and structured with the MVP architecture, the app seamlessly integrates with PHP API services to provide a smooth and efficient experience for users."
        },
        {
            "name": "Awfar Inc.",
            "date": "Apr 2019 - Aug 2019",
            "position": "iOS Developer",
            "location": "Maadi",
            "role": "Part-Time",
            "todo": "Developed Awfar Restaurants, a template app designed to support customizable schemes for various restaurants. The app provides a user-friendly interface for customers to easily make online reservations, allowing them to select their preferred time and table. Built using Swift, with Alamofire for networking, and implemented the MVP architecture, seamlessly integrated with PHP API services."
        },
        {
            "name": "Entrepreware",
            "date": "Feb 2018 - Mars 2020",
            "position": "Android & iOS Developer",
            "location": "Maadi",
            "role": "Full-Time",
            "todo": "Started as an Android Development intern, gaining hands-on experience through a side project and assisting with the main project. Progressed to contribute to a Spring Boot MVC project, where I designed and implemented a new feature called “Cafeteria” a POS system. <br>Later transitioned to working on the company’s primary iOS Objective-C template project for schools. This multi-scheme project integrated with Spring Boot MVC APIs and a camera system, enabling parents to monitor their children.<br>Finally, contributed to the development of the Edufy app, built with Ionic (Angular+). This app allows teachers to assign homework, track attendance, and manage various classroom activities."
        },
        {
            "name": "Entrepreware",
            "date": "Dec 2017 - Feb 2018",
            "position": "Android Developer Intern",
            "location": "Maadi",
            "role": "Intern",
            "todo": "Create simple project with it's backend using Java and Boot Spring MVC."
        }
    ],
    "project": [
        {
            "id": 1,
            "name": "El Ezaby",
            "sub_name": "Pharmacy",
            "slogen": "El Ezaby Pharmacy app",
            "clinet": "Awfar Inc.",
            "clinet_site": "https://solutions.awfar.com/",
            "position": "Senior iOS Software Engineer",
            "date": "Feb 2020 - Present",
            "role": "Full-time",
            "description": "El Ezaby pharmacies mobile application is your \"to go\" portal for all your medical, cosmetics, and health needs. <br> <br> El Ezaby pharmacies mobile application offers:<br>- Home Delivery.<br>- Online Payment.<br>- More than 11,000 products.<br>- Detailed products' descriptions.<br>- Online Medical insurance's prescriptions cash out.<br>- Online Products' availability checking.<br>- Scanning the product's bar code from your mobile's camera to make sure it's available.<br>Download the biggest pharmaceutical mobile application, and enjoy the promo codes and gifts.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "SwiftUI",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 2,
            "name": "Wayak - وياك",
            "sub_name": "Your Meds, Your Health",
            "slogen": "Wayak - ONE APPLICATION FOR ALL YOUR MEDICAL NEEDS",
            "clinet": "Wayak",
            "clinet_site": "https://wayakcard.com/en/",
            "position": "iOS Developer",
            "date": "Dec 2022 - Nov 2024",
            "role": "Freelance",
            "description": "Healthcare Service Platform<br>Wayak is an innovative mobile application designed to simplify healthcare management while reducing costs. As an iOS developer, I contributed to building and optimizing an app that unifies multiple healthcare services, providing users with a seamless experience for managing prescriptions, consultations, and medical services.<br>Key Features Developed:<br>• Medication Delivery Service: Integrated a feature for free home delivery of prescribed medications, with savings up to 20%.<br>•  Easy Ordering System: Implemented search functionality for medications by name, category, or prescription upload, streamlining the ordering process.<br>•  Unlimited Medical Consultations: Developed a system for users to access free, unlimited medical consultations via the app.<br>•  Wayak Card Discounts: Integrated a digital card offering users up to 40% savings at trusted medical centers and labs.<br>•  User Experience Optimization: Focused on intuitive UI/UX design and efficient app performance to enhance user engagement and satisfaction.<br>This project highlights my proficiency in mobile app development, UI/UX design, and integrating third-party services to create a comprehensive and cost-effective healthcare solution.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Swift",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 3,
            "name": "Awfar Chat",
            "sub_name": "CRM Chat System",
            "slogen": "Awfar Chat Center",
            "clinet": "Awfar Inc.",
            "clinet_site": "https://solutions.awfar.com/eg/awfar-chat-center/",
            "position": "UI/UX Designer - iOS Developer",
            "date": "Feb 2022 - Feb 2024",
            "role": "Freelance",
            "description": "Awfar Customer Engagement Platform – the ultimate solution for streamlining customer interactions and enhancing engagement with your business. Awfar Chat empowers businesses to efficiently manage and connect website and mobile application chats, all in one easy-to-use platform.<br>Key Features:<br>1. Seamless Chat Management:* Awfar Chat brings together chats from your website and mobile application into a single, unified dashboard. Stay connected with your customers in real-time and never miss a conversation again.<br>2. Multi-Channel Communication:* Engage with your customers across more than 10 online communication channels, all from one place. Connect through WhatsApp, Facebook, Instagram messages, and more, providing a unified experience for your customers.<br>3. Unlimited Data Insights:* Awfar Chat's comprehensive data management allows you to harness the power of customer data. Track and analyze customer interactions, enabling you to make data-driven decisions for your business.<br>4. Personalized Customer Campaigns:* Tailor your messages to specific customer segments and interests. Create personalized campaigns for both new and returning customers to enhance their experience and boost brand loyalty.<br>5. Automated Chatbot Support:* Integrate chatbots into your interactions to efficiently handle frequently asked questions and provide immediate responses, even outside regular business hours.<br>6. Dynamic Chat Distribution:* Assign chats to employees, departments, or branches automatically, optimizing workload distribution and ensuring timely responses to your customers.<br>7. E-Commerce on WhatsApp:* Showcase your products and facilitate seamless purchasing experiences within the app through our E-Commerce feature on WhatsApp.<br>8. Real-Time Employee Performance Tracking:* Monitor employee performance, track response times, and optimize productivity with Awfar Chat's performance monitoring tools.<br>9. Secure User Accounts:* Ensure the safety of your data with individual user accounts, allowing businesses to manage access to the platform securely.<br>10. Detailed Analytics and Reports:* Access a wide range of detailed reports and analytics to measure your team's efficiency, customer satisfaction, and business growth.<br>Awfar Chat is your go-to customer engagement platform that ensures effortless management of customer communications. As a Software-as-a-Service (SaaS) platform, we prioritize your business's success by providing cutting-edge technology solutions without any paid content or subscriptions.<br>Experience the power of Awfar Chat and discover a new era of customer engagement and seamless communication. Download now and revolutionize the way you interact with your customers!",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Swift",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 4,
            "name": "TEBCOM",
            "sub_name": "Doctor - Patient",
            "slogen": "TEBCOM Online Medical Community",
            "clinet": "TEBCOM",
            "clinet_site": "https://tebcom.net/",
            "position": "iOS Developer",
            "date": "Feb 2022 - Feb 2024",
            "role": "Freelance",
            "description": "Developed TEBCOM, a comprehensive Closed-Loop Tele-Consultation solution with two tailored schemes:<br>1.  TEBCOM for Patients: Designed for patients to easily access professional healthcare services from anywhere.<br>2.  TEBCOM - Doctor for Doctors: Built to help doctors manage virtual consultations and provide one-on-one care seamlessly.<br>The apps enable virtual clinics, breaking barriers to healthcare access across the globe. Integrated with .NET, SignalR for real-time communication, and Twilio for secure video and audio calls. Developed using Swift and the MVP architecture, this solution ensures doctors can run their online practices as efficiently as their physical ones, delivering professional care while maintaining quality and reliability.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Swift",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 5,
            "name": "E-commerce",
            "sub_name": "Template",
            "slogen": "Awfar E-commerce System - CRM",
            "clinet": "Awfar",
            "clinet_site": "https://solutions.awfar.com/",
            "position": "Senior iOS Software Engineer",
            "date": "Feb 2020 - Present",
            "role": "Full-Time",
            "description": "Awfar E-commerce Project is an innovative, template-based mobile application designed to streamline the online presence of various businesses, including pharmacies, stationery stores, supermarkets, and more. By offering a versatile platform, it empowers businesses to launch their e-commerce services with minimal effort and maximum customization.<br>1.  Customizable Templates: The app features modular templates that can be tailored to suit the branding and operational requirements of different business types.<br>2.  User-Friendly Interface: It provides an intuitive, easy-to-navigate interface for customers, enhancing their shopping experience.<br>3.  Dynamic Product Catalogs: Businesses can showcase products through rich, categorized catalogs that support images, descriptions, and prices.<br>4.  Inventory Management: Real-time inventory tracking ensures accuracy in stock availability.<br>5.  Secure Payment Gateways: The app supports multiple payment methods, including cards, e-wallets, and cash on delivery.<br>6.  Multi-Language and Multi-Currency: It caters to global and local audiences with flexible language and currency options.<br>7.  Order Management: Businesses can manage orders efficiently with features like order tracking, notifications, and history logs.<br>8.  Push Notifications: The app enables direct customer engagement with promotional updates, offers, and reminders.<br>9.  Custom Branding: Businesses can personalize the app’s design, including colors, logos, and themes, to reflect their identity.<br>10.  Cross-Platform Compatibility: The app is accessible on both Android and iOS platforms.<br>11.  Responsive Design: Ensures seamless operation on various devices, including smartphones and tablets.<br>12.  Analytics Dashboard: Built-in analytics help businesses monitor performance, track sales, and identify trends.<br>13.  Scalable Architecture: Designed to grow with businesses, the app handles increasing user and product volumes effectively.<br>14.  Integration Options: Compatible with external systems such as ERPs or CRMs for enhanced operational capabilities.<br>15.  Quick Deployment: Ready-to-deploy templates reduce development time, allowing businesses to go live faster.<br>16.  Customer Accounts: Users can create accounts for a personalized shopping experience, including wishlists and order histories.<br>17.  Search Functionality: Advanced search and filter options make product discovery effortless.<br>18.  Offline Support: Limited offline functionality ensures continuity during network interruptions.<br>19.  Cost-Effective Solution: An affordable alternative to building custom e-commerce platforms from scratch.<br>20.  Ideal for SMEs and Startups: Provides a professional, scalable, and user-friendly solution for businesses looking to establish or expand their online presence.<br>The Awfar E-commerce Project is a practical, feature-rich platform enabling businesses of all sizes to thrive in the digital marketplace.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "SwiftUI",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 6,
            "name": "Awfar Connect",
            "sub_name": "Design",
            "slogen": "Awfar Delivery System",
            "clinet": "Awfar",
            "clinet_site": "https://solutions.awfar.com/",
            "position": "Senior iOS Software Engineer - UI/UX Designer",
            "date": "Jan 2023",
            "role": "Full-Time",
            "description": "Awfar Connect is an integrated on-demand delivery platform that provides delivery, shipping and logistics companies, and the organization of all deliveries and shipments delivering products and financial transactions to its customers safely and in a very short period of time through a network of well-trained staff To provide the highest quality and professional customer service.<br>Time is precious and Over Connect is the best solution to avoid delay delivery that may be caused by traffic congestion or remote destinations because the better contact will combine no delivery person but the delivery team to carry out the delivery task in minutes",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Figma",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 7,
            "name": "Awfar Chat",
            "sub_name": "Website",
            "slogen": "Awfar Chat System",
            "clinet": "Awfar",
            "clinet_site": "https://solutions.awfar.com/",
            "position": "Senior iOS Software Engineer",
            "date": "Aug 2021",
            "role": "Full-Time",
            "description": "Collaborated on the development and design of a chat platform. Utilized Angular 11 for the initial build and transitioned to React.js and Node.js for an updated version, enhancing functionality and performance. Focused on creating an intuitive user interface and ensuring seamless real-time communication features.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Figma",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 8,
            "name": "La Maison",
            "sub_name": "Compound template app",
            "slogen": "La Maison - future of modern compounds",
            "clinet": "Millennium for Investment & Information Technology",
            "clinet_site": "https://wuzzuf.net/jobs/careers/Millennium-for-Investment--amp--Information-Technology-Egypt-47827",
            "position": "Senior iOS Software Engineer - UI/UX Designer",
            "date": "Feb 2021 - Mar 2021",
            "role": "Freelance",
            "description": "Developed La Maison, a template app designed to streamline the management of residential compounds. The app facilitates communication between residents and administration, provides access to compound services, and manages compound news and resident requests.<br>Key features include QR code access for residents to securely enter their homes and QR code invitations for visitors, enhancing compound security. Built using Swift, with Alamofire for networking, and structured with the MVP architecture, the app is seamlessly integrated with PHP API services.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Swift",
                    "percentage": ""
                },
                {
                    "logo": "",
                    "name": "Figma",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 9,
            "name": "Entrepreware - Student",
            "sub_name": "Schools Template App",
            "slogen": "Entrepreware for education",
            "clinet": "Entrepreware",
            "clinet_site": "http://entrepreware.com/",
            "position": "iOS Developer",
            "date": "Feb 2018 - Mars 2020",
            "role": "Full-Time",
            "description": "Developed La Maison, a template app designed to streamline the management of residential compounds. The app facilitates communication between residents and administration, provides access to compound services, and manages compound news and resident requests.<br>Key features include QR code access for residents to securely enter their homes and QR code invitations for visitors, enhancing compound security. Built using Swift, with Alamofire for networking, and structured with the MVP architecture, the app is seamlessly integrated with PHP API services.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Objective-C",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 10,
            "name": "Edufy - Teachers",
            "sub_name": "Schools Teacher App",
            "slogen": "Edufy: Educator's life made easy.",
            "clinet": "Entrepreware",
            "clinet_site": "http://entrepreware.com/",
            "position": "iOS Developer",
            "date": "Feb 2018 - Mars 2020",
            "role": "Full-Time",
            "description": "The Edufy application is designed to convert teacher websites into efficient and user-friendly mobile applications, specifically for Entrepreware’s nursery and school partners. The role focuses on using Ionic with Angular 2+ to build cross-platform apps with restricted access for verified teachers and educators.<br>Key Responsibilities:<br>1.  Mobile Application Development:<br>•   Build responsive, feature-rich mobile applications using Ionic Framework and Angular 2+.<br>•   Ensure compatibility across Android and iOS platforms.<br>2.  Access Restriction and Security:<br>•   Implement authentication and role-based access control, limiting access to teachers and educators from Entrepreware partners.<br>•   Ensure compliance with security best practices for data integrity and user privacy.<br>3.  Seamless Integration:<br>•   Convert existing teacher websites into mobile-friendly applications, maintaining consistency in design and functionality.<br>•   Optimize API integrations for smooth data exchange between websites and apps.<br>4.  Feature Development:<br>•   Develop custom tools like lesson planners, progress trackers, and communication modules tailored for educators.<br>•   Implement real-time updates and notifications for efficient user interaction.<br>5.  Testing and Quality Assurance:<br>•   Perform rigorous testing to ensure high performance, usability, and bug-free deployment.<br>•   Monitor and optimize app performance for smooth user experiences.<br>6.  Collaboration:<br>•   Work closely with Entrepreware’s partners to understand their specific needs and deliver tailored solutions.<br>•   Maintain regular updates and communication with stakeholders for feedback and improvements.<br>This role offers the opportunity to contribute to empowering educators through modern technology, leveraging Ionic Angular 2+ for scalable and secure app solutions.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Ionic",
                    "percentage": ""
                },
                {
                    "logo": "",
                    "name": "Angular 2+",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 11,
            "name": "QClinic",
            "sub_name": "Medical Appointments",
            "slogen": "QClinic: Medical Appointments Application",
            "clinet": "QClinics",
            "clinet_site": "http://www.qclinics.net/",
            "position": "iOS Developer",
            "date": "Dec 2019 - Jan 2020",
            "role": "Freelance",
            "description": "Medical Appointments Application<br>•   Designed and developed a user-friendly iOS application that enables patients to book medical appointments by selecting their preferred time slots for specific services.<br>•   Utilized Swift and core iOS frameworks to create an intuitive and responsive interface, ensuring a seamless user experience.<br>•   Implemented real-time API integration to synchronize time slots, services, and appointment availability with the backend system.<br>•   Worked on feature enhancements, including notification systems for reminders and service categorization for efficient navigation.<br>•   Conducted extensive testing and debugging to ensure app stability and performance before release.<br>•   Collaborated with a cross-functional team of designers and backend developers to deliver a high-quality product aligned with user needs.<br>This role emphasized delivering a modern and accessible solution to streamline medical appointment scheduling for patients and healthcare providers.",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Swift",
                    "percentage": ""
                },
                {
                    "logo": "",
                    "name": "Angular 2+",
                    "percentage": ""
                }
            ]
        },
        {
            "id": 12,
            "name": "Enterpreware",
            "sub_name": "Schools",
            "slogen": "Enterpreware For Education",
            "clinet": "Enterpreware",
            "clinet_site": "http://entrepreware.com/",
            "position": "iOS Developer",
            "date": "Feb 2018 - Mars 2020",
            "role": "FullTime",
            "description": "",
            "mainImage": "",
            "subImage": "",
            "otherImage": "",
            "technology": [
                {
                    "logo": "",
                    "name": "Boot Spring MVC",
                    "percentage": ""
                },
                {
                    "logo": "",
                    "name": "SQL",
                    "percentage": ""
                }
            ]
        }
    ]
}